# panda versions
which gives the current pandas version you are using

In [1]:
import pandas as pd
import numpy as np
pd.__version__

'0.23.4'

But if you also need to know the versions of pandas' dependencies, you can use the show_versions() function:

In [2]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.5.2.final.0
python-bits: 64
OS: Linux
OS-release: 4.4.0-150-generic
machine: x86_64
processor: x86_64
byteorder: little
LC_ALL: None
LANG: en_IN
LOCALE: en_IN.ISO8859-1

pandas: 0.23.4
pytest: 5.0.1
pip: 19.2.1
setuptools: 41.0.1
Cython: None
numpy: 1.17.0
scipy: 0.17.0
pyarrow: None
xarray: None
IPython: 7.2.0
sphinx: None
patsy: 0.5.1
dateutil: 2.7.5
pytz: 2014.10
blosc: None
bottleneck: None
tables: 3.2.2
numexpr: 2.4.3
feather: None
matplotlib: 3.0.2
openpyxl: 2.3.0
xlrd: 1.2.0
xlwt: None
xlsxwriter: 0.7.3
lxml: 3.5.0
bs4: 4.4.1
html5lib: 0.999
sqlalchemy: 1.3.3
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: None

# Create a dataframe using numpy array using numpy with random numbers

there are many wways to create a dataframe suppose you want to create a dataframe by giving column names you can use this method

In [3]:
import pandas as pd
import numpy as np
df  = pd.DataFrame()
df['Col1'] = np.random.randint(0,100,   size=200)
df['Col2'] = np.random.randint(100,200, size=200)
df['Col3'] = np.random.randint(200,300, size=200)
df['Col4'] = np.random.randint(300,400, size=200)
df.head()

   Col1  Col2  Col3  Col4
0    40   156   247   376
1    73   129   243   397
2    88   110   297   395
3    22   129   240   368
4    26   163   268   392

Alternative ways to create a dataframe is

In [4]:
#in which 5 in the no of rows and 8 isnumber of columns and a-h are column names
pd.DataFrame(np.random.rand(5, 8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.006151,0.560691,0.541605,0.621651,0.200688,0.840379,0.713274,0.546089
1,0.454823,0.328681,0.226061,0.272415,0.859547,0.103232,0.642254,0.967175
2,0.958158,0.204979,0.474230,0.304206,0.619381,0.054524,0.226035,0.108593
3,0.200425,0.398893,0.333466,0.466042,0.388761,0.551480,0.590676,0.158727
4,0.989027,0.228682,0.276847,0.879402,0.910570,0.453458,0.700135,0.030650

# Rename the pandas columns

In [5]:
#before doing cahnges to the dataframe just check the column names in the beginning
df.head(2)

   Col1  Col2  Col3  Col4
0    40   156   247   376
1    73   129   243   397

suppose if you wnat to change the particular column names then use this set of code

In [6]:
df = df.rename({'Col1':'col_1', 'Col2':'col_2'}, axis='columns')
df.head()

   col_1  col_2  Col3  Col4
0     40    156   247   376
1     73    129   243   397
2     88    110   297   395
3     22    129   240   368
4     26    163   268   392

suppose if you want to chaange all the column names again you can do this

In [7]:
df.columns = ['col_11', 'col_12', 'col_13', 'col_14']
df.head()

   col_11  col_12  col_13  col_14
0      40     156     247     376
1      73     129     243     397
2      88     110     297     395
3      22     129     240     368
4      26     163     268     392

Now if the only thing you're doing is replacing spaces with underscores, an even better method is to use the str.replace() method, since you don't have to type out all of the column names:

In [8]:
df.columns = df.columns.str.replace('_', '')
df.head()

   col11  col12  col13  col14
0     40    156    247    376
1     73    129    243    397
2     88    110    297    395
3     22    129    240    368
4     26    163    268    392

now if you want to add prefix or suffix to the columns use df.add_prefix('X_') for prefix and df.add_suffix('_Y') for suffix
lets look at some examples

In [9]:
#for adding prefix
df = df.add_prefix('A_')
df.head()

   A_col11  A_col12  A_col13  A_col14
0       40      156      247      376
1       73      129      243      397
2       88      110      297      395
3       22      129      240      368
4       26      163      268      392

now  if you want to add suffix to the column use:

In [10]:
# first lets remove the prefix whatever we added then we will add suffix
df.columns = df.columns.str.replace('A_', '')

#now use suffix method to append str to col names
df = df.add_suffix('_A')
df.head()

   col11_A  col12_A  col13_A  col14_A
0       40      156      247      376
1       73      129      243      397
2       88      110      297      395
3       22      129      240      368
4       26      163      268      392

# Expand a Series of lists into a DataFrame

In [11]:
#Let's create another example DataFrame:
df = pd.DataFrame({'col_one':['a', 'b', 'c'], 'col_two':[[10, 40], [20, 50], [30, 60]]})
df.head()

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

suppose there is a list inside the columns and if you want to access it as a dataframe use apply method

In [12]:
df_new = df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

And by using concat you can add those 2 columns again to the  old dataframe

In [29]:
pd.concat([df, df_new], axis='columns')

   col_one  col_three  col_two   0   1
0      1.1        7.7      4.4  10  40
1      2.2        8.8      5.5  20  50
2      3.3        0.0      6.6  30  60

# Split a string into multiple columns

lets create a dataframe to try this

In [14]:
df = pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],
                   'location':['Los Angeles, CA', 'Washington, DC']})
df

          location             name
0  Los Angeles, CA  John Arthur Doe
1   Washington, DC   Jane Ann Smith

suppose if you want to expand the name column and split

In [15]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

These three columns can actually be saved to the original DataFrame in a single assignment statement:
along with column names

In [16]:
df[['first', 'middle', 'last']] = df.name.str.split(' ', expand=True)
df

          location             name first  middle   last
0  Los Angeles, CA  John Arthur Doe  John  Arthur    Doe
1   Washington, DC   Jane Ann Smith  Jane     Ann  Smith

If we only cared about saving the city name , we can just select that column and save it to the DataFrame:
[0] indicates that whatever is present before ',' only that will be selected

In [17]:
df['city'] = df.location.str.split(', ', expand=True)[0]
df

          location             name first  middle   last         city
0  Los Angeles, CA  John Arthur Doe  John  Arthur    Doe  Los Angeles
1   Washington, DC   Jane Ann Smith  Jane     Ann  Smith   Washington

# Convert strings to numbers

In [18]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_three col_two
0     1.1       7.7     4.4
1     2.2       8.8     5.5
2     3.3         -     6.6

In [19]:
df.dtypes

col_one      object
col_three    object
col_two      object
dtype: object

as you can see above all are of the types string so lets convert first col_one and col_two to integers

In [20]:
df.astype({'col_one':'float','col_two':'float'}).dtypes

col_one      float64
col_three     object
col_two      float64
dtype: object

as you can see both column one and col two are converted to types floating points
now in col_three we cannot convert directly beacuse we have a string '-' which cannot be converted to int so 
use pd.to_numeric so it will cnvert other strings to NaN values

In [21]:
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

now we can easily convert this to type integer

In [22]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [23]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df.head()

   col_one  col_three  col_two
0      1.1        7.7      4.4
1      2.2        8.8      5.5
2      3.3        0.0      6.6

In [24]:
#now you can see that you have converted all the columns to the datatype float from object
df.dtypes

col_one      float64
col_three    float64
col_two      float64
dtype: object